Ran Plan for project: `cloud-cloudflare-dns` dir: `infrastructure/cloud/cloudflare/dns` workspace: `terragrunt`

<details><summary>Show Output</summary>

```diff
22:35:38.860 INFO   Downloading Terraform configurations from ../../.. into ./.terragrunt-cache/8ebXUt5nVzXULYHMJ7TWlF3AZ8k/RnXWVc7nAaLzGbd_J7oKJRuJ4dM
22:35:39.436 STDOUT tofu: Initializing the backend...
22:35:39.842 STDOUT tofu: 
22:35:39.842 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
22:35:39.842 STDOUT tofu: use this backend unless the backend configuration changes.
22:35:40.006 STDOUT tofu: Initializing provider plugins...
22:35:40.006 STDOUT tofu: - Reusing previous version of vexxhost/uptimerobot from the dependency lock file
22:35:40.152 STDOUT tofu: - Finding paultyng/unifi versions matching "~> 0.41"...
22:35:40.223 STDOUT tofu: - Reusing previous version of hashicorp/aws from the dependency lock file
22:35:40.301 STDOUT tofu: - Reusing previous version of backblaze/b2 from the dependency lock file
22:35:40.370 STDOUT tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
22:35:40.457 STDOUT tofu: - Reusing previous version of integrations/github from the dependency lock file
22:35:41.677 STDOUT tofu: - Installing hashicorp/aws v5.67.0...
22:36:43.976 STDOUT tofu: - Installed hashicorp/aws v5.67.0 (signed, key ID 0C0AF313E5FD9F80)
22:36:45.088 STDOUT tofu: - Installing backblaze/b2 v0.8.12...
22:36:54.331 STDOUT tofu: - Installed backblaze/b2 v0.8.12. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:36:55.172 STDOUT tofu: - Installing cloudflare/cloudflare v4.42.0...
22:36:59.554 STDOUT tofu: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
22:37:00.673 STDOUT tofu: - Installing integrations/github v6.2.2...
22:37:03.793 STDOUT tofu: - Installed integrations/github v6.2.2 (signed, key ID 38027F80D7FD5FB2)
22:37:04.951 STDOUT tofu: - Installing vexxhost/uptimerobot v0.8.2...
22:37:07.084 STDOUT tofu: - Installed vexxhost/uptimerobot v0.8.2. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:37:08.163 STDOUT tofu: - Installing paultyng/unifi v0.41.0...
22:37:09.724 STDOUT tofu: - Installed paultyng/unifi v0.41.0. Signature validation was skipped due to the registry not containing GPG keys for this provider
22:37:09.724 STDOUT tofu: Providers are signed by their developers.
22:37:09.725 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
22:37:09.725 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
22:37:09.725 STDOUT tofu: OpenTofu has made some changes to the provider dependency selections recorded
22:37:09.725 STDOUT tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
22:37:09.731 STDOUT tofu: version control system if they represent changes you intended to make.
22:37:09.736 STDOUT tofu: OpenTofu has been successfully initialized!

22:37:53.432 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
22:37:53.433 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
22:37:53.435 STDOUT tofu:   + create
22:37:53.435 STDOUT tofu: OpenTofu will perform the following actions:
22:37:53.435 STDOUT tofu:   # cloudflare_record.internal_record["adguard_internal"] will be created
22:37:53.435 STDOUT tofu:   + resource "cloudflare_record" "internal_record" {
22:37:53.435 STDOUT tofu:       + allow_overwrite = false
22:37:53.435 STDOUT tofu:       + content         = (known after apply)
22:37:53.436 STDOUT tofu:       + created_on      = (known after apply)
22:37:53.436 STDOUT tofu:       + hostname        = (known after apply)
22:37:53.436 STDOUT tofu:       + id              = (known after apply)
22:37:53.436 STDOUT tofu:       + metadata        = (known after apply)
22:37:53.436 STDOUT tofu:       + modified_on     = (known after apply)
22:37:53.436 STDOUT tofu:       + name            = "adguard.internal"
22:37:53.436 STDOUT tofu:       + proxiable       = (known after apply)
22:37:53.438 STDOUT tofu:       + proxied         = false
22:37:53.439 STDOUT tofu:       + ttl             = 1
22:37:53.439 STDOUT tofu:       + type            = "A"
22:37:53.439 STDOUT tofu:       + value           = "192.168.1.51"
22:37:53.439 STDOUT tofu:       + zone_id         = (sensitive value)
22:37:53.439 STDOUT tofu:     }
22:37:53.439 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
22:37:53.439 STDOUT tofu: 
22:37:53.439 STDOUT tofu: ╷
22:37:53.439 STDOUT tofu: │ Warning: Argument is deprecated
22:37:53.440 STDOUT tofu: │ 
22:37:53.440 STDOUT tofu: │   with cloudflare_record.internal_record["argocd_internal"],
22:37:53.440 STDOUT tofu: │   on 01-record.tf line 8, in resource "cloudflare_record" "internal_record":
22:37:53.440 STDOUT tofu: │    8:   value   = each.value["value"]
22:37:53.440 STDOUT tofu: │ 
22:37:53.440 STDOUT tofu: │ `value` is deprecated in favour of `content` and will be removed in the
22:37:53.441 STDOUT tofu: │ next major release.
22:37:53.441 STDOUT tofu: │ 
22:37:53.441 STDOUT tofu: │ (and 10 more similar warnings elsewhere)
22:37:53.441 STDOUT tofu: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cloud-cloudflare-dns
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.internal.siutsin.com/lock?id=siutsin%252Fotaru%252Finfrastructure%252Fcloud%252Fcloudflare%252Fdns%252Fterragrunt)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cloud-cloudflare-dns
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```